Revit 2027 API
MEPSpaceConstruction.DuplicateConstruction Method
Create a new construction for Space constructions.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPBuildingConstruction DuplicateConstruction(
	MEPBuildingConstruction pCurrentConstruction,
	string pName
)
Public Function DuplicateConstruction (
	pCurrentConstruction As MEPBuildingConstruction,
	pName As String
) As MEPBuildingConstruction
public:
MEPBuildingConstruction^ DuplicateConstruction(
	MEPBuildingConstruction^ pCurrentConstruction,
	String^ pName
)
member DuplicateConstruction :
        pCurrentConstruction : MEPBuildingConstruction *
        pName : string -> MEPBuildingConstruction
Parameters
pCurrentConstruction MEPBuildingConstruction
The existing construction to be duplicated.
pName String
The name of the new construction.
Return Value
MEPBuildingConstruction
Remarks
If the name is same with the existing one, an exception will be thrown.
See Also
Reference
MEPSpaceConstruction Class
Autodesk.Revit.DB.Mechanical Namespace